<?php

ini_set('session.gc_maxlifetime', 86400);
ini_set('session.cookie_lifetime', 86400);
ini_set('session.save_path', $_SERVER['DOCUMENT_ROOT'] .'/sessions');
session_start();

header_remove('x-powered-by');
date_default_timezone_set("Asia/Dushanbe");
mb_internal_encoding("UTF-8");
ini_set("display_errors", 1);
error_reporting(E_ALL);

include("config.php");
include("db_functions.php");
include("prog_functions.php");
include("functions.php");


/* ЗОНАИ ЭЪЛОНКУНИИ ДОИМИҲО */

/* ИВАЗКУНИИ S_Y ва H_Y */
$SYHY  = @query("SELECT `s_y`, `h_y` FROM `users` WHERE `id` = '{$_SESSION['user']['id']}'");
$s_year = @$SYHY[0]['s_y'];
$h_year = @$SYHY[0]['h_y'];
if($s_year == 24 && $h_year == 2){
	define("S_Y", 24);
	define("H_Y", 2);	
}else{
	define("S_Y", $s_year);
	define("H_Y", $h_year);
}
/* ИВАЗКУНИИ S_Y ва H_Y */

if(H_Y == 1){
	define("START_DATE", "2024-09-02");
}else{
	define("START_DATE", "2025-02-02");
}

define ("WEEK", weeksSinceDate(START_DATE));
if(WEEK >=8 && WEEK < 17){
	define("RATING", 1);
}else{
	define("RATING", 2);
}

define("ALLOWED_IMG_FROMAT", ['bmp','gif','jpeg','jpg','png']);
define("NOT_RATING", [34,35,36, 2880, 37, 38, 1921,1922,2153,2546, 2590,2154, 2548, 1740, 2425, 1923, 2547, 2764]);

define("ONLINE_TIME", 600);
define("UNI_NAME", "Донишгоҳи байналмилалии сайёҳӣ ва соҳибкории Тоҷикистон");
define("UNI_NAME_RU", "Донишгоҳи байналмилалии сайёҳӣ ва соҳибкории Тоҷикистон");

define("SHORT_UNI_NAME", "ДБССТ");

define("RECTOR", "Асрорзода Убайдулло Саттор");
define("ANT", "Абдулозода Беҳрузи Назруло");


define("SCORE_IMT", 40);
define("SCORE_IMT_TRIMESTR", 100);
define("SCORE_RATING", 50);

define("QUESTIONS", 20);
define("MINUTES", 30);

define("GUZARISH_SCORE", 25);

define("IMT_STATUS", 0);
define("LANG", "tj");

if(H_Y == 1){
	define("SEMESTRS", "1,3,5,7,9");
}elseif(H_Y == 2){
	define("SEMESTRS", "2,4,6,8,10");
}

define("HUJJAT_MONEY", 25);


define("DOGOVOR", 0);

$start_ip = ip2long("100.100.100.0"); // Преобразуем начальный IP в целое число
$end_ip = ip2long("100.100.101.255"); // Преобразуем конечный IP в целое число

$ip_range = []; // Массив для хранения IP-адресов


for ($ip = $start_ip; $ip <= $end_ip; $ip++) {
   $ip_range[] = long2ip($ip); // Преобразуем целое число обратно в IP и добавляем в массив
}


$IPS = ['192.168.254.3', '185.177.2.169', '185.194.199.21', '10.152.18.73', '10.230.3.111', '109.228.49.100', '185.194.199.33', '80.233.243.218'];

$IPS = array_merge($IPS, $ip_range);

$elon_type = [
	1 => 'Ба омӯзгорҳо',
	2 => 'Ба донишҷӯён',
	3 => 'Ба ҳама'
];

$worker_type = [
	1 => 'Ҳамкори асосӣ',
	2 => 'Ҳамкори дохилӣ',
	3 => 'Ҳамкори беруна'
];


$LIMITS = [
	1 => 2,
	2 => 2,
	3 => 2,
	4 => 2,
	5 => 1,
	6 => 1
];

$imt_types = [
	1 => 'Тестӣ',
	2 => 'Хатӣ',
	3 => 'Маҳорат',
	4 => 'Шифоҳӣ'
];

$test_types = [
	1 => 'Донишгоҳӣ',
	2 => 'Факултетӣ',
	3 => 'Тахасусӣ'
];


$dars_namud = [
	'loihai_kursi' => 'Лоиҳаи курсӣ',
	'kori_kursi' => 'Кори курсӣ',
	'lk_plan' => 'Лексия',
	'ozm_plan' => 'Кори озмоишӣ',
	'ozm_plan_2' => 'Кори озмоишӣ 2',
	'am_plan' => 'Кори амалӣ',
	'am_plan_2' => 'Кори амалӣ 2',
	'sm_plan' => 'Семинар',
];


/* ЗОНАИ ЭЪЛОНКУНИИ ДОИМИҲО */

$langs = [
	'tj' => 'Тоҷикӣ',
	'ru' => 'Русӣ',
	'en' => 'Англисӣ',
	'uz' => 'Узбекӣ',
	'ki' => 'Чинӣ'
	
];


$xatmnamud = [
	1 => "Мактаби миёна",
	2 => "Коллеҷ",
	3 => "Мактаби олӣ",
	4 => "Литсейи касби "
];

$hujjati_xatm = [
	1 => "Аттестат",
	2 => "Диплом"
];


$vazi_ijtimoi = [
	1 => "Солим",
	2 => "Маъюб"
];

$vazi_oilavi_form = [
	1 => "Муҷаррад",
	2 => "Оиладор",
	3 => "Ҷудошуда"
];


$az_oilai_ki = [
	1 => "Коргар",
	2 => "Деҳқон",
	3 => "Соҳибкор"
];


$pardoxt_types = [
	1 => "Пардохт барои қабули ҳуҷҷатҳои довталаб",
	2 => "Пардохт барои шартномаи таҳсил",
	3 => "Пардохт барои триместр",
	4 => "Пардохт барои фарқиятҳо",
	5 => "Пардохт барои хобгоҳ"
];

$sabab_khorij = [
	1 => 'Ба рухсати академи баромадан',
	2 => 'Ба дигар донишгоҳ рафтан',
	3 => 'Бо хоҳиши худаш хориҷ шудан',
	4 => 'Хориҷ аз ҳисоби қарзи академи',
	5 => 'Хориҷ аз ҳисоби давомот',
	6 => 'Алоқа кандан аз донишгоҳ',
	7 => 'Хориҷ аз ҳисоби доштани қарзи молиявӣ',
	8 => 'Пас аз академи шуруъ накардан ба машғулятҳо'
];

$khobgoh_dtt = [
	1 => "Хобгоҳӣ №1",
	2 => "Хобгоҳӣ №2",
	3 => "Хобгоҳӣ №3",
	4 => "Хобгоҳӣ №4",
	5 => "Хобгоҳӣ №5",
	6 => "Хобгоҳӣ №6",
	7 => "Хобгоҳӣ №7",
	8 => "Хобгоҳӣ №8"
];

$unvonho = [
	0 => "Даъватшаванда",
	1 => "Сержанти хурд",
	2 => "Сержант",
	3 => "Сержанти калон",
	4 => "Пропорчик",
	5 => "Лейтинанти хурд",
	6 => "Лейтинант",
];


$lashkar = [
	1 => "Надорам",
	2 => "Лашкар 2",
	3 => "Лашкар 3",
	4 => "Лашкар 4",
	5 => "Лашкар 5",
	6 => "Лашкар 6",
];
$daysOfWeek = [
	1 => 'Душанбе',
	2 => 'Сешанбе',
	3 => 'Чоршанбе',
	4 => 'Панҷшанбе',
	5 => 'Ҷумъа',
	6 => 'Шанбе'
];



$id_sinf = [
	5 => "Синфи 5",
	6 => "Синфи 6",
	7 => "Синфи 7",
	8 => "Синфи 8",
	9 => "Синфи 9",
	10 => "Синфи 10",
	11 => "Синфи 11"
];


$months = [
	1 => 'Январ',
	2 => 'Феврал',
	3 => 'Март',
	4 => 'Апрел',
	5 => 'Май',
	6 => 'Июн',
	7 => 'Июл',
	8 => 'Август',
	9 => 'Сентябр',
	10 => 'Октябр',
	11 => 'Ноябр',
	12 => 'Декабр',
];

$alphabet = [
	'A', 'Б', 'В', 'Г', 'Ғ', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Ӣ', 'Й', 'К', 'Қ', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ӯ', 'Ф', 'Х', 'Ҳ', 'Ч', 'Ҷ', 'Ш', 'Ъ', 'Э', 'Ю', 'Я'
];


$questions_type = [
	1 => 'Интихоби танҳо',
	2 => 'Интихоби бисёр',
	3 => 'Мувофиқат',
	4 => 'Пуркунии ҷойҳои холӣ',
	5 => 'Дохилкунии калима',
	6 => 'Дохилкунии рақам'
];

?>